<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\User;

class UserSeeder extends Seeder
{
    public function run(): void
    {
        $users = [
            ['name' => 'عبد الناصر البكاي', 'phone' => '0910000001'],
            ['name' => 'عبد الرؤوف البكاي', 'phone' => '0910000002'],
            ['name' => 'عبد الستار البكاي', 'phone' => '0910000003'],
            ['name' => 'عبد الباسط البكاي', 'phone' => '0910000004'],
            ['name' => 'عبد الحي البكاي', 'phone' => '0910000034'],
            ['name' => 'خالد البكاي', 'phone' => '0910000005'],
            ['name' => 'عبد العزيز البكاي', 'phone' => '0910000006'],
            ['name' => 'عبدالله البكاي', 'phone' => '0910000007'],
            ['name' => 'احمد البكاي', 'phone' => '0910000008'],
            ['name' => 'عبد الوهاب البكاي', 'phone' => '0910000009'],
            ['name' => 'عبد الحميد البكاي', 'phone' => '0910000010'],
            ['name' => 'يونس البكاي', 'phone' => '0910000011'],
            ['name' => ' الهادي البكاي', 'phone' => '0910000012'],
            ['name' => ' بشير البكاي', 'phone' => '0910000013'],
            ['name' => 'اسماعيل البكاي', 'phone' => '0910000014'],
            ['name' => 'حذيفه البكاي', 'phone' => '0910000015'],
            ['name' => 'عبد الرشيد البكاي', 'phone' => '0910000016'],
            ['name' => 'عبد المجيد البكاي', 'phone' => '0910000017'],
            ['name' => 'الياس البكاي', 'phone' => '0910000018'],
            ['name' => 'يوسف البكاي', 'phone' => '0910000019'],
            ['name' => 'محمد مصطفى البكاي', 'phone' => '0910000020'],
            ['name' => 'وسام البكاي', 'phone' => '0910000021'],
            ['name' => 'حسام البكاي', 'phone' => '0910000022'],
            ['name' => 'نور الدين البكاي', 'phone' => '0910000023'],
            ['name' => 'ناجي البكاي', 'phone' => '0910000024'],
            ['name' => 'عبد الرزاق عكي', 'phone' => '0910000025'],
            ['name' => 'احمد عكي', 'phone' => '0910000026'],
            ['name' => 'عبد القادر عكي', 'phone' => '0910000027'],
            ['name' => 'محمد عكي', 'phone' => '0910000028'],
            ['name' => 'عبد الفتاح عكي', 'phone' => '0910000029'],
            ['name' => 'الهادي عكي', 'phone' => '0910000030'],
            ['name' => 'سراج الطاهر عكي', 'phone' => '0910000031'],


        ];

        foreach ($users as $user) {
            User::create([
                'name' => $user['name'],
                'phone' => $user['phone'],
                'status' => 'active'
            ]);
        }
    }
}